{
  "question": "Quelles métriques principales et secondaires ont été utilisées ?",
  "mode": "rag",
  "top_k": 8,
  "items": [
    {
      "rank": 1,
      "score": 0.8287234902381897,
      "node_id": "91c746df-40c6-4e1d-ba16-7f745216b063",
      "len": 824,
      "text": "La tâche associée est la reconnaissance d'images , spécifiquement de feuilles associées à 18 espèces végétales (fruits, légumineuses, céréales), dont les contours puis les détails sont progressivement analysées à travers les couches du réseau de neurones modélisé. Métriques de performance utilisées pour comparer les modèles A ce stade nous avons choisi 2 métriques. Métrique principale Accuracy : Compte tenu de la limitation du déséquilibre entre classes obtenu après la phase de pre-processing, nous avons choisi de retenir l'Accuracy comme métrique principale, définie comme le rapport entre le "
    },
    {
      "rank": 2,
      "score": 0.8057870268821716,
      "node_id": "bc9a9b50-9e4a-4494-8eda-b6c330ec00c4",
      "len": 263,
      "text": "Plusieurs traitements sont appliqués aux images dans le but d'améliorer leur qualité. Les traitements incluent des ajustements sur la luminosité, le contraste, la netteté (flou et netteté), ainsi que des redimensionnements. Les étapes sont détaillées ci-dessous :"
    },
    {
      "rank": 3,
      "score": 0.8141151666641235,
      "node_id": "edd789d3-c1ff-416e-9d71-4c000e924c95",
      "len": 338,
      "text": "- Les classes minoritaires (Healthy, Bacterial blight, Brown streak disease, Green mottle) ont été massivement augmentées. - L'objectif était d'atteindre un volume comparable à la classe majoritaire (Cassava Mosaic Disease). - Les techniques utilisées incluent : rotations, flips, changements de luminosité, contrastes, translations, etc."
    },
    {
      "rank": 4,
      "score": 0.8039752840995789,
      "node_id": "d18524a6-bdc8-418e-8d8e-57ccb6182db0",
      "len": 334,
      "text": "L'application sera développée sur Streamlit conformément au schéma de l'application présentée en Page 6 en veillant à des règles d'ergonomie de « base » (éviter les images de fond, contraste des couleurs pour faciliter la lecture, usage des couleurs limité à une gamme réduite, boutons de navigation explicites, etc.) Jalons du projet"
    },
    {
      "rank": 5,
      "score": 0.8037052154541016,
      "node_id": "a01b10c5-85bb-4dcc-aedd-e2f2d3d92820",
      "len": 252,
      "text": "La deuxième phase a été consacrée à l'interprétation des modèles en utilisant des outils comme GradCam ou SHAP ainsi qu'à l'apprentissage, par lequel nous commençons cette phase, d'un modèle alternatif aux CNN et Transformer Standard : Swintransformer."
    },
    {
      "rank": 6,
      "score": 0.8165683746337891,
      "node_id": "2ad5fba8-7f7b-4dfe-a99e-34a045e542d6",
      "len": 609,
      "text": "Nous n'avons pas eu recours à des experts externes à proprement parler (en-dehors de Damien évidemment !) mais avons réalisé de nombreuses recherches afin de nous guider, notamment sur les sujets suivants : - Taille des images standard utilisée dans les algorithmes de reconnaissance d'image ; - Détermination du niveau de flou d'une image et seuil d'acceptabilité pour la reconnaissance d'images (150 de Laplacienne) ; - Retraitement des niveaux de flous ; - Déséquilibre acceptable entre classes sur le fichier d'entraînement (1 à 10) ; Nombre minimal d'images à soumettre à l'algorithme par classe"
    },
    {
      "rank": 7,
      "score": 0.8037338852882385,
      "node_id": "cb8f9fec-43b6-4e97-934c-bcdf10e9e42d",
      "len": 688,
      "text": ", Résultats Global rank = . , models = EffNetV2M Swin. , accuracy = 0.9865. , fl score = 0.9856. , nb_models = . , cassava_only = False. , Résultats Global rank = . , models = EffNetV2M ResNet5oV2. , accuracy = 0.9855. , fl score = 0.9847. , nb_models = . , cassava_only = False. , Résultats Global rank = . , models = EffNetV2M. , accuracy = 0.9858. , fl score = 0.9845. , nb_models = . , cassava_only = False. , Résultats Global rank = . , models = EffNetV2M. , accuracy = 0.9841. , fl score = 0.9837. , nb_models = . , cassava_only = False. , Résultats Global rank = . , models = EffNetV2M Swin. ,"
    },
    {
      "rank": 8,
      "score": 0.8031929731369019,
      "node_id": "96e8f950-14b6-406e-a81d-4ff987921314",
      "len": 817,
      "text": "Width Width Avant retraitement, les images avaient des dimensions très variées, ce qui compliquait leur analyse et leur traitement uniforme. Cette hétérogénéité des tailles pouvait entraîner des biais lors de l'application de modèles d'apprentissage automatique ou d'autres analyses d'images, car les réseaux de neurones et les algorithmes de traitement d'images nécessitent des entrées de taille uniforme. Après retraitement, toutes les images ont été redimensionnées à une taille standard de 256x256 pixels, un format couramment utilisé dans la datascience. Cette normalisation permet non seulement"
    }
  ],
  "alpha_lexical": 0.35,
  "mmr_lambda": 0.6,
  "use_rrf": true
}